let text5 = `Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

Нижче наведено список країн і вартість доставки.

Китай - 100 кредитів
Чилі - 250 кредитів
Австралія - 170 кредитів
Індія - 80 кредитів
Ямайка - 120 кредитів`

function task5() {
    function capitalize(string) {
        return string.charAt(0).toUpperCase() + string.slice(1);
  }
  let countrySelected = prompt("What country?").toLowerCase();
  switch (countrySelected) {
      case "китай":
          alert(`Доставка в ${capitalize(countrySelected)} буде коштувати 100 кредитів.`);
          break;
      case "чилі":
          alert(`Доставка в ${capitalize(countrySelected)} буде коштувати 250 кредитів.`);
          break;
      case "автралія":
          alert(`Доставка в ${capitalize(countrySelected)} буде коштувати 170 кредитів.`);
          break;
      case "індія":
          alert(`Доставка в ${capitalize(countrySelected)} буде коштувати 80 кредитів.`);
          break;
      case "ямайка":
          alert(`Доставка в ${capitalize(countrySelected)} буде коштувати 120 кредитів.`);
          break;
      default:
          alert(`У вашій країні доставка недоступна.`);
          break;
  }
}