let text2 = `Напиши скрипт перевірки кількості товарів на складі. Є змінні total (кількість товарів на складі) і ordered (одиниць товару в замовленні).

Порівняй ці значення і за результатами виведи:

Якщо в замовленні вказано число, що перевищує кількість товарів на складі, то виведи повідомлення "На складі недостатньо товарів!".
В іншому випадку виводь повідомлення "Замовлення оформлено, з вами зв'яжеться менеджер".
Перевір працездатність коду з різними значеннями змінної ordered, наприклад 20, 80 і 130.`

function task2(){
	const total = 100;
	let ordered = 50;
	
	function answer(orderedAmount) {
		return orderedAmount > total ? "На складі недостатньо товарів!" : "Замовлення оформлено, з вами зв'яжеться менеджер";
	}
	console.log(answer(ordered));
	ordered = 101;
	console.log(answer(ordered));
	ordered = 10;
	console.log(answer(ordered));
	ordered = 2000;
	console.log(answer(ordered));
}
